<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class FieldOfWorkSeeder extends Seeder
{
    public function run(): void
    {
$fields = [
    'الابتكار',
    'الاستشارات الإدارية',
    'الإدارة التنفيذية',
    'الإعلام وصناعة المحتوى',
    'البحث العلمي',
    'البرمجة وتطوير البرمجيات',
    'التجارة الإلكترونية',
    'التحول الرقمي',
    'الترجمة والتعريب',
    'التسويق الاجتماعي',
    'التسويق الرقمي',
    'التصميم الجرافيكي',
    'التصميم الداخلي والديكور',
    'التطوير المؤسسي',
    'التعليم والتدريب',
    'التمويل الأصغر والخدمات المصرفية',
    'التوجيه والإرشاد المهني',
    'الجودة والامتثال',
    'الدعم التقني',
    'الذكاء الاصطناعي',
    'السياحة والسفر',
    'العلاقات العامة والتواصل',
    'العمل الإنساني والتنموي',
    'القيادة',
    'المبيعات وخدمة العملاء',
    'المحاسبة والمالية',
    'الموارد البشرية',
    'أمن المعلومات والسيبراني',
    'إدارة العمليات',
    'إدارة الفعاليات',
    'إدارة المشاريع',
    'إدارة المنتجات الرقمية',
    'تحليل البيانات',
    'تطوير الأعمال',
    'تطوير المحتوى التعليمي',
    'ريادة الأعمال',
    'سلاسل التوريد واللوجستيات',
    'كتابة المحتوى والتحرير',
    'كتابة المقترحات وإدارة المنح',
    'هندسة الحاسوب',
];


        foreach ($fields as $field) {
            DB::table('work_fields')->insert([
                'name' => $field,
                'created_at' => now(),
                'updated_at' => now(),
            ]);
        }
    }
}