<?php

namespace App\Enums;

enum ImportantTopicsType: string
{
    case اختبار_البرمجيات = 'اختبار البرمجيات';
    case الابتكار = 'الابتكار';
    case الاختراق = 'الاختراق';
    case الأمن_السيبراني_وحماية_البيانات = 'الأمن السيبراني وحماية البيانات';
    case الإدارة_المالية = 'الإدارة المالية';
    case الإعلانات = 'الإعلانات';
    case البرمجة = 'البرمجة';
    case التحول_الرقمي = 'التحول الرقمي';
    case التخطيط_والتنفيذ_الاستراتيجي = 'التخطيط والتنفيذ الاستراتيجي';
    case التسويق_التقليدي = 'التسويق التقليدي';
    case التسويق_الرقمي = 'التسويق الرقمي';
    case التشفير_وإدارة_الوصول = 'التشفير وإدارة الوصول';
    case التصوير = 'التصوير';
    case التفاوض = 'التفاوض';
    case التفكير_الإبداعي = 'التفكير الإبداعي';
    case التفكير_التصميمي = 'التفكير التصميمي';
    case التفكير_النقدي = 'التفكير النقدي';
    case التمويل_الجماعي = 'التمويل الجماعي';
    case التيسير = 'التيسير';
    case الحوسبة_السحابية = 'الحوسبة السحابية';
    case الحوكمة = 'الحوكمة';
    case الذكاء_العاطفي = 'الذكاء العاطفي';
    case السيرة_الذاتية = 'السيرة الذاتية';
    case العلاقات_مع_المانحين = 'العلاقات مع المانحين';
    case العمل_المستقل = 'العمل المستقل';
    case القيادة = 'القيادة';
    case المبيعات = 'المبيعات';
    case المحاسبة = 'المحاسبة';
    case المراقبة_والتقييم = 'المراقبة والتقييم';
    case المغالطات_المنطقية = 'المغالطات المنطقية';
    case المنهجية_الرشيقة = 'المنهجية الرشيقة';
    case الموارد_البشرية = 'الموارد البشرية';
    case الموشن_جرافيك = 'الموشن جرافيك';
    case أتمتة_العمليات = 'أتمتة العمليات';
    case أدوات_الذكاء_الاصطناعي = 'أدوات الذكاء الاصطناعي';
    case أمن_الشبكات = 'أمن الشبكات';
    case إدارة_الأداء = 'إدارة الأداء';
    case إدارة_البرامج = 'إدارة البرامج';
    case إدارة_الجودة = 'إدارة الجودة';
    case إدارة_الفرق = 'إدارة الفرق';
    case إدارة_المتاجر_الإلكترونية = 'إدارة المتاجر الإلكترونية';
    case إدارة_المخدمات = 'إدارة المخدمات Servers';
    case إدارة_المشاريع = 'إدارة المشاريع';
    case إدارة_المنتجات_الرقمية = 'إدارة المنتجات الرقمية';
    case إدارة_قواعد_البيانات = 'إدارة قواعد البيانات';
    case إدارة_وسائل_التواصل_الاجتماعي = 'إدارة وسائل التواصل الاجتماعي';
    case بناء_الشراكات = 'بناء الشراكات';
    case بناء_العلاقات = 'بناء العلاقات';
    case تحسين_حساب_لينكد_ان = 'تحسين حساب لينكد ان';
    case تحسين_محركات_البحث = 'تحسين محركات البحث (SEO)';
    case تحليل_البيانات = 'تحليل البيانات';
    case تدريب_المدربين = 'تدريب المدربين';
    case تصميم_العروض_التقديمية = 'تصميم العروض التقديمية';
    case تطوير_البرمجيات_الخلفية = 'تطوير البرمجيات الخلفية';
    case تطوير_الواجهات_وتجربة_المستخدم = 'تطوير الواجهات وتجربة المستخدم';
    case تطوير_الويب = 'تطوير الويب';
    case تطوير_تطبيقات_الموبايل = 'تطوير تطبيقات الموبايل';
    case تطوير_واجهات_الاستخدام = 'تطوير واجهات الاستخدام';
    case تعلم_الآلة = 'تعلم الآلة';
    case خدمة_العملاء = 'خدمة العملاء';
    case دراسة_الجدوى = 'دراسة الجدوى';
    case ريادة_الأعمال = 'ريادة الأعمال';
    case كتابة_التقارير = 'كتابة التقارير';
    case كتابة_المحتوى = 'كتابة المحتوى';
    case كتابة_مقترحات_المشاريع = 'كتابة مقترحات المشاريع';
    case مفاهيم_العمل_التنموي_والإنساني = 'مفاهيم العمل التنموي والإنساني';
    case مقابلات_العمل = 'مقابلات العمل';
    case منهجية_لين = 'منهجية لين';
    case مهارات_التواصل = 'مهارات التواصل';
    case مهارات_القوة = 'مهارات القوة';
    case مونتاج_الفيديو = 'مونتاج الفيديو';
    case نماذج_الأعمال_التجارية = 'نماذج الأعمال التجارية';
    case هندسة_البيانات = 'هندسة البيانات';

    /**
     * إرجاع جميع القيم كمصفوفة
     */
    public static function values(): array
    {
        return array_column(self::cases(), 'value');
    }
}
