<?php

namespace App\Enums;

enum JobPositionEnum: string
{
    case رئيس_مجلس_إدارة = 'رئيس مجلس إدارة';
    case عضو_مجلس_إدارة = 'عضو مجلس إدارة';
    case المدير_العام_أو_المدير_التنفيذي = 'المدير العام/المدير التنفيذي';
    case مدير_في_الصف_الأول = 'مدير في الصف الأول';
    case مدير_مكتب = 'مدير مكتب';
    case مستشار = 'مستشار';
    case منسق = 'منسق';
    case مشرف_فريق = 'مشرف فريق';
    case مشرف_ميداني = 'مشرف ميداني';
    case معلم_أو_مدرس = 'معلم/مدرس';
    case مرشد_مهني = 'مرشد مهني';
    case محاضر_جامعي = 'محاضر جامعي';
    case موظف = 'موظف';
    case متطوع = 'متطوع';
    case متدرب = 'متدرب';
    case مسؤول = 'مسؤول';
    case ميسر = 'ميسر';
    case مساعد = 'مساعد';

    public static function values(): array
    {
        return array_column(self::cases(), 'value');
    }
}
